<template>
    <div class="v-container">
<div class="text-h3 mb-16">Добро пожаловать в тестовую версию Stock exchange data</div>
<p class="text-justify my-5">
    На текущий момент на сайте функционирует биржевой стакан, данные получаются в реальном времени через WebSocket с сайта Binance.
    Данные отражаются по 20 строк на продажу и 20 строк на покупку, между указанными строками расчитывается спред.
    Серым цветом выделяются 2 и 3 цена продажи, а так же 3 и 4 цена покупки на момент запроса списка цен и валют, данные поля являются (условно) ордерами пользователя,
    и реализованы для тестирования. Выделение цветом исчезает, когда количество торгуемой валюты равно 0.
</p>
<p class="text-left text-body-1">
    <ul>
    В ближайшее время будет добавлено:
    <li>добавлено <span class="text-decoration-line-through">возможность выбора количества отражаемых строк;</span></li>
        <li>возможность выделения цветом конкретного уровня цены;</li>
            <li>возможность добавления нескольких валют на один экран;</li>
            <li>прочие мелкие доработки функционала;</li>
                <li>японские свечи.</li>
</ul>
</p>
</div>
</template>
